---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.HasSimpleType
source: html/e81ed10b-72de-efa9-af1d-cb15feccb396.htm
---
# Autodesk.Revit.DB.IFC.IFCData.HasSimpleType Method

Determines if there is one corresponding IFC type.

## Syntax (C#)
```csharp
public bool HasSimpleType()
```

## Returns
False if there are no corresponding IFC types, or more than one; returns true otherwise.